phase 1 done - still need more work to be done
